[Alerte scan de ports]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = https://soc_n8n/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 15 * * * *
description = Alerte quand une ip scanne plus de 100 ports / IPs
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="test" sourcetype="wineventlog:microsoft-windows-sysmon/operational" EventCode=3\
| rename SourceIp as src_ip DestinationIp as dest_ip DestinationPort as dest_port\
| stats dc(dest_port) as num_dest_port dc(dest_ip) as num_dest_ip by src_ip\
| where num_dest_port > 5 OR num_dest_ip > 5

[Kerberoasting]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = https://soc_n8n/webhook-test/alert
alert.digest_mode = false
alert.suppress = false
alert.suppress.period = 60s
alert.track = false
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="test" sourcetype="WinEventLog:Security" EventCode=4769 Ticket_Encryption_Type=0x17\
| where NOT match(TargetUserName, "\$$")\
| bin _time span=1h\
| stats count by _time, TargetUserName, IpAddress\
| where count > 5

[Dump LSASS]
alert.digest_mode = 0
alert.severity = 4
alert.suppress = 1
alert.suppress.fields = host
alert.suppress.period = 60s
alert.track = 1
cron_schedule = * * * * *
description = Detect LSASS dump using prodmup, mimikatz
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=*\
| where process_name IN ("procdump.exe", "procdump64.exe", "mimikatz.exe")\
    OR CommandLine LIKE "%lsass%" \
    OR CommandLine LIKE "%procdump -ma%"\
    OR CommandLine LIKE "%sekurlsa%"\
| table _time host user process_name CommandLine ParentImage ParentCommandLine

[Exécution de procdump sur DC]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = https://soc_n8n/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Accès","action","Action_du_filtre","Adresse_de_destination","Adresse_source","app","Attributs_de_ressource","body","category","ComputerName","dest","dest_nt_host","Direction","Domaine_du_compte","dvc","dvc_nt_host","Error_Code","event_id","EventCode","EventType","eventtype","id","ID","ID de règle","ID de sécurité","ID du processus créateur","ID d’exécution","ID d’exécution de la couche","ID d’exécution du filtre","ID d’ouverture de session","ID_condition","ID_de_connexion","ID_du_handle","ID_du_nouveau_processus","ID_du_processus","index","Keywords","linecount","LogName","Masque d’accès","Message","name","Nom","Nom de la règle","Nom de l’application","Nom de l’objet","Nom du processus créateur","Nom_de_la_couche","Nom_du_compte","Nom_du_nouveau_processus","Nom_du_processus","object","OpCode","Poids","Port_de_destination","Port_source","Privilèges","product","Profil utilisé","Protocole","punct","Raison","RecordNumber","Serveur de l’objet","severity","severity_id","signature","signature_id","SourceName","splunk_server","status","subject","ta_windows_action","tag","tag::eventtype","TaskCategory","Type","Type d'élévation du jeton","Type d’objet","Type_de_modification","Valeur_de_correspondance","Valeur_de_la_condition","vendor","État de fin","Étiquette obligatoire"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Security" EventCode=4688 host="DC.test.local"\
Nom_du_nouveau_processus="*procdump.exe*"\
| table _time host Nom_du_nouveau_processus Nom_du_compte Nom_du_processus ID_du_nouveau_processus Message

[Suspicious modification of Run registry key]
action.webhook.enable_allowlist = 0
alert.expires = 2d
alert.suppress = 1
alert.suppress.fields = host
alert.suppress.period = 5m
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test\
(\
    (\
        (EventCode=12 OR EventCode=13)\
        AND TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"\
    )\
    OR\
    (\
        EventCode=4657\
        AND ObjectName="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"\
    )\
)\
| eval newval=coalesce(NewValue, Details)\
| search NOT newval="*OneDrive*" \
        NOT newval="*Teams*" \
        NOT newval="*EdgeUpdate*" \
        NOT newval="*GoogleUpdate*"\
| table _time host EventCode User TargetObject ObjectName Details NewValue

[Kerberoasing_f]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = true
alert.expires = 2d
alert.suppress = true
alert.suppress.period = 5m
alert.track = false
counttype = number of events
cron_schedule = 0 * * * *
description = Detect Kerberoasting tentatives, excluding machine account and krbtgt.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test EventCode=4769 \
Nom_du_service!=krbtgt\
| where NOT like(Nom_du_compte, "%$%")

[Password Looting]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = false
alert.suppress = false
alert.suppress.period = 60s
alert.track = false
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="test" sourcetype="kunai_json"\
| spath path=data.command_line output=cmd\
| eval cmd=lower(trim(cmd))\
| eval loot=case(\
    like(cmd, "%cat /etc/passwd%"), "passwd_read",\
    like(cmd, "%cat /etc/shadow%"), "shadow_read",\
    like(cmd, "%cp /etc/passwd%"), "passwd_copy",\
    like(cmd, "%cp /etc/shadow%"), "shadow_copy",\
    like(cmd, "%scp%passwd%"), "passwd_exfil",\
    like(cmd, "%scp%shadow%"), "shadow_exfil",\
    like(cmd, "%tar%passwd%"), "passwd_archive",\
    like(cmd, "%tar%shadow%"), "shadow_archive",\
    like(cmd, "%unshadow%"), "unshadow",\
    like(cmd, "%hashcat%"), "hashcat"\
)\
| where isnotnull(loot)\
| table _time host user cmd loot

[Enumération Linux]
action.email.to = paul.baratin@insa-cvl.fr
action.email.useNSSubject = 1
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = false
alert.suppress = false
alert.suppress.period = 60s
alert.track = false
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="test" sourcetype="kunai_json"\
| spath\
| spath path=data.command_line output=cmd\
| search cmd!=""\
| eval suspicious_command=case(\
    match(cmd, "whoami"), "whoami",\
    match(cmd, "\bid\b"), "id",\
    match(cmd, "uname -a"), "uname",\
    match(cmd, "hostname"), "hostname",\
    match(cmd, "dmesg"), "dmesg",\
    match(cmd, "uptime"), "uptime",\
    match(cmd, "\benv\b"), "env",\
\
    match(cmd, "ifconfig"), "ifconfig",\
    match(cmd, "ip addr"), "ip addr",\
    match(cmd, "ip link"), "ip link",\
    match(cmd, "ip route"), "ip route",\
    match(cmd, "\bss\b"), "ss",\
    match(cmd, "netstat"), "netstat",\
    match(cmd, "\barp\b"), "arp",\
    match(cmd, "\bdig\b"), "dig",\
    match(cmd, "nslookup"), "nslookup",\
    match(cmd, "curl"), "curl",\
    match(cmd, "wget"), "wget",\
\
    match(cmd, "cat /etc/passwd"), "passwd",\
    match(cmd, "cat /etc/shadow"), "shadow",\
    match(cmd, "getent passwd"), "getent passwd",\
    match(cmd, "groups"), "groups",\
    match(cmd, "lastlog"), "lastlog",\
\
    match(cmd, "ps aux"), "ps aux",\
    match(cmd, "top"), "top",\
    match(cmd, "journalctl"), "journalctl",\
\
    match(cmd, "ls -la"), "ls -la",\
    match(cmd, "find /"), "find",\
    match(cmd, "stat "), "stat",\
    match(cmd, "df -h"), "df -h",\
    match(cmd, "du -sh"), "du -sh",\
    match(cmd, "mount"), "mount",\
\
    match(cmd, "crontab -l"), "crontab",\
\
    match(cmd, "getcap"), "getcap"\
)\
| search suspicious_command!=""\
| bin _time span=1m\
| stats dc(suspicious_command) as uniq values(suspicious_command) as commandes by host, _time\
| where uniq >= 5

[ASREP-Roasting]
alert.expires = 2d
alert.suppress = 1
alert.suppress.period = 5m
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 5
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test EventCode=4768\
| eval PreAuthType = coalesce('Type de pré-authentification','PreAuth_Type','Pre-Authentication_Type',"0")\
| where PreAuthType="0"\
| table _time, host, src, Account_Name, Service_Name, PreAuthType\
| rename src AS "Source IP", Account_Name AS "User", Service_Name AS "Service"