[Password Looting 4]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = false
alert.suppress = false
alert.suppress.period = 60s
alert.track = false
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" sourcetype="kunai_json"\
| spath path=data.command_line output=cmd\
| eval cmd=lower(trim(cmd))\
| eval loot=case(\
    like(cmd, "%cat /etc/passwd%"), "passwd_read",\
    like(cmd, "%cat /etc/shadow%"), "shadow_read",\
    like(cmd, "%cp /etc/passwd%"), "passwd_copy",\
    like(cmd, "%cp /etc/shadow%"), "shadow_copy",\
    like(cmd, "%scp%passwd%"), "passwd_exfil",\
    like(cmd, "%scp%shadow%"), "shadow_exfil",\
    like(cmd, "%tar%passwd%"), "passwd_archive",\
    like(cmd, "%tar%shadow%"), "shadow_archive",\
    like(cmd, "%unshadow%"), "unshadow",\
    like(cmd, "%hashcat%"), "hashcat"\
)\
| where isnotnull(loot)\
| table host cmd loot sourcetype\
| eval alert_title="Password Looting"\
| eval alert_description="Password Looting Kunai Linux"\
| rename sourcetype as alert_source\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| eval alert_severity_id=2\
| rename cmd as alert_source_content

[Alerte scan de ports]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = https://soc_n8n/webhook-test/alert
alert.digest_mode = false
alert.expires = 24d
alert.suppress = false
alert.suppress.period = 60s
alert.track = false
counttype = number of events
cron_schedule = */5 * * * *
description = Alerte quand une ip scanne plus de 100 ports / IPs
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" sourcetype="wineventlog:microsoft-windows-sysmon/operational" EventCode=3\
| rename SourceIp as src_ip DestinationIp as dest_ip DestinationPort as dest_port\
| stats dc(dest_port) as num_dest_port dc(dest_ip) as num_dest_ip by src_ip\
| where num_dest_port > 5 OR num_dest_ip > 5

[Exécution de procdump sur DC]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Accès","action","Action_du_filtre","Adresse_de_destination","Adresse_source","app","Attributs_de_ressource","body","category","ComputerName","dest","dest_nt_host","Direction","Domaine_du_compte","dvc","dvc_nt_host","Error_Code","event_id","EventCode","EventType","eventtype","id","ID","ID de règle","ID de sécurité","ID du processus créateur","ID d’exécution","ID d’exécution de la couche","ID d’exécution du filtre","ID d’ouverture de session","ID_condition","ID_de_connexion","ID_du_handle","ID_du_nouveau_processus","ID_du_processus","index","Keywords","linecount","LogName","Masque d’accès","Message","name","Nom","Nom de la règle","Nom de l’application","Nom de l’objet","Nom du processus créateur","Nom_de_la_couche","Nom_du_compte","Nom_du_nouveau_processus","Nom_du_processus","object","OpCode","Poids","Port_de_destination","Port_source","Privilèges","product","Profil utilisé","Protocole","punct","Raison","RecordNumber","Serveur de l’objet","severity","severity_id","signature","signature_id","SourceName","splunk_server","status","subject","ta_windows_action","tag","tag::eventtype","TaskCategory","Type","Type d'élévation du jeton","Type d’objet","Type_de_modification","Valeur_de_correspondance","Valeur_de_la_condition","vendor","État de fin","Étiquette obligatoire"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="test" source="WinEventLog:Security" EventCode=4688 host="DC.test.local"\
Nom_du_nouveau_processus="*procdump.exe*"\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| table alert_source_event_time host Nom_du_nouveau_processus Nom_du_compte Nom_du_processus ID_du_nouveau_processus Message sourcetype\
| eval alert_title="Procdump"\
| eval alert_description="Exécution de procdump sur DC"\
| rename sourcetype as alert_source\
| eval alert_severity_id=3\
| rename Message as alert_source_content

[Création d’un service Windows suspect (T1543.003)]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Cette alerte détecte la création potentiellement malveillante d’un service Windows.\
Elle corrèle les journaux de sécurité natifs (EventCode 4697) avec les événements Sysmon de création de processus (EventCode 1 lorsque sc.exe est exécuté) afin d’identifier les services installés avec un binaire ou une commande suspects.\
\
L’alerte se déclenche lorsqu’un service est créé à partir de chemins inhabituels (Temp, AppData, Users\Public, Downloads, Desktop) ou via des commandes typiquement utilisées dans des attaques (PowerShell, mshta, wscript, cscript, rundll32, cmd /c, etc)
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_nouveau_processus","data.command_line","Image"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" \
(\
    (source="WinEventLog:Security" EventCode=4697)\
    OR\
    (source="WinEventLog:Microsoft-Windows-Sysmon/Operational"\
        EventCode=1\
        AND Image="*\\sc.exe"\
    )\
)\
| eval suspicious_binpath = case(\
        source="WinEventLog:Security"\
        AND (\
               like(Nom_de_fichier_du_service, "%\\Temp\\%")\
            OR like(Nom_de_fichier_du_service, "%\\AppData\\%")\
            OR like(Nom_de_fichier_du_service, "%\\Users\\Public%")\
        ), 1,\
\
        source="WinEventLog:Microsoft-Windows-Sysmon/Operational"\
        AND (\
               like(CommandLine, "%powershell%")\
            OR like(CommandLine, "%mshta%")\
            OR like(CommandLine, "%wscript%")\
            OR like(CommandLine, "%cscript%")\
            OR like(CommandLine, "%rundll32%")\
            OR like(CommandLine, "%cmd.exe /c%")\
            OR like(CommandLine, "%cmd.exe /k%")\
            OR like(CommandLine, "%C:\\Users\\Public%")\
            OR like(CommandLine, "%\\Downloads\\%")\
            OR like(CommandLine, "%\\Desktop\\%")\
            OR like(CommandLine, "%C:\\Windows\\Temp\\%")\
            OR like(CommandLine, "%\\AppData\\Local\\Temp%")\
        ), 1,\
\
        true(), 0\
)\
| where suspicious_binpath=1\
| eval ServiceName = coalesce(Nom_du_service, ServiceName)\
| rex field=CommandLine "create\s+(?<ServiceName>[^\s]+)"\
| eval BinPath = coalesce(Nom_de_fichier_du_service, BinPath)\
| rex field=CommandLine "binPath=\s+\"(?<BinPath>[^\"]+)\""\
| eval Account = coalesce(Nom_du_compte, User)\
| eval Message = coalesce(CommandLine, BinPath, ServiceName)\
| eval alert_title="Création de service suspecte"\
| eval alert_description="Création de service Windows potentiellement malveillante"\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| rename sourcetype AS alert_source\
| eval alert_severity_id=3\
| rename Message AS alert_source_content\
| table host alert_title alert_description alert_source alert_source_event_time alert_severity_id alert_source_content

[Enumération Linux]
action.email.to = paul.baratin@insa-cvl.fr
action.email.useNSSubject = 1
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" sourcetype="kunai_json"\
| spath\
| spath path=data.command_line output=cmd\
| search cmd!=""\
| eval suspicious_command=case(\
    match(cmd, "whoami"), "whoami",\
    match(cmd, "^id "), "id",\
    match(cmd, "uname -a"), "uname",\
    match(cmd, "hostname"), "hostname",\
    match(cmd, "dmesg"), "dmesg",\
    match(cmd, "uptime"), "uptime",\
    match(cmd, "\benv\b"), "env",\
\
    match(cmd, "ifconfig"), "ifconfig",\
    match(cmd, "ip addr"), "ip addr",\
    match(cmd, "ip link"), "ip link",\
    match(cmd, "ip route"), "ip route",\
    match(cmd, "\bss "), "ss",\
    match(cmd, "netstat"), "netstat",\
    match(cmd, "\barp\b"), "arp",\
    match(cmd, "\bdig\b"), "dig",\
    match(cmd, "nslookup"), "nslookup",\
    match(cmd, "curl"), "curl",\
    match(cmd, "wget"), "wget",\
\
    match(cmd, "cat /etc/passwd"), "passwd",\
    match(cmd, "cat /etc/shadow"), "shadow",\
    match(cmd, "getent passwd"), "getent passwd",\
    match(cmd, "groups"), "groups",\
    match(cmd, "lastlog"), "lastlog",\
\
    match(cmd, "ps aux"), "ps aux",\
    match(cmd, "top"), "top",\
    match(cmd, "journalctl"), "journalctl",\
\
    match(cmd, "ls -la"), "ls -la",\
    match(cmd, "find /"), "find",\
    match(cmd, "stat ")  AND NOT match(cmd, "update-motd") AND NOT match(cmd, "/var/lib/ubuntu-release-upgrader/release-upgrade-available"), "stat",\
    match(cmd, "df -h"), "df -h",\
    match(cmd, "du -sh"), "du -sh",\
    match(cmd, "mount"), "mount",\
\
    match(cmd, "crontab -l"), "crontab",\
\
    match(cmd, "getcap"), "getcap"\
)\
| search suspicious_command!=""\
| bin _time span=1m\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| stats dc(suspicious_command) as uniq values(suspicious_command) as commandes by host alert_source_event_time sourcetype\
| where uniq >= 3\
| eval alert_title="Commande d'énumération Linux"\
| eval alert_description="Commande d'énumération Linux"\
| rename sourcetype as alert_source\
| eval alert_severity_id=2\
| rename commandes as alert_source_content

[Dump LSASS]
action.list = 1
action.list.severity = 4
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.severity = 4
alert.suppress = 0
alert.suppress.fields = host
alert.suppress.period = 60s
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Detect LSASS dump using prodmup, mimikatz
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=prod\
| where process_name IN ("procdump.exe", "procdump64.exe", "mimikatz.exe")\
    OR CommandLine LIKE "%lsass%" \
    OR CommandLine LIKE "%procdump -ma%"\
    OR CommandLine LIKE "%sekurlsa%"\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| table host alert_source_event_time sourcetype Message\
| eval alert_title="Dump LSASS"\
| eval alert_description="Dump LSASS"\
| rename sourcetype as alert_source\
| eval alert_severity_id=2\
| rename Message as alert_source_content

[Scan port suricata]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" source="/var/log/suricata/eve.json" event_type="alert"\
| search alert.signature=*scan* OR alert.category=*recon*\
| stats count min(_time) AS alert_source_event_time BY src_ip, dest_ip, alert.signature, alert.severity\
| where count > 10\
| eval alert_source_event_time=strftime(alert_source_event_time, "%Y-%m-%d %H:%M:%S")\
| eval alert_title="Scan port suricata"\
| eval alert_description="Scan de port Suricata"\
| rename sourcetype as alert_source\
| eval alert_severity_id=1\
| rename alert.signature as alert_source_content

[ASREP-Roasting]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.suppress = 0
alert.suppress.period = 5m
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 5
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" EventCode=4768\
| eval PreAuthType = coalesce('Type de pré-authentification','Pre_Authentication_Type',"0")\
| where PreAuthType="0"\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| table host alert_source_event_time sourcetype Message\
| eval alert_title="ASREP-Roasting"\
| eval alert_description="ASREP-Roasting"\
| rename sourcetype as alert_source\
| eval alert_severity_id=1\
| rename Message as alert_source_content

[Linux - Accès /etc/shadow]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = false
alert.expires = 24d
alert.suppress = false
alert.suppress.period = 60s
alert.track = false
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_nouveau_processus","data.command_line","Image"]
display.events.type = table
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" sourcetype="kunai_json"\
| spath\
| spath path=info.host.name output=host\
| spath path=info.task.user output=user\
| spath path=data.command_line output=cmd\
| spath path=data.path output=path\
| where like(cmd, "%/etc/shadow%") OR path="/etc/shadow"\
| stats earliest(_time) as firstSeen\
        latest(_time) as lastSeen\
        values(cmd) as cmds\
        values(user) as users\
  by host sourcetype\
| eval alert_source_event_time = strftime(firstSeen, "%Y-%m-%d %H:%M:%S")\
| eval alert_title = "Accès au fichier /etc/shadow"\
| eval alert_description = "Accès au fichier /etc/shadow (fichier des mots de passe) sur un serveur Linux, activité de credential dumping potentielle."\
| rename sourcetype AS alert_source\
| eval alert_severity_id = 3\
| eval alert_source_content = mvjoin(cmds, "; ")\
| table host alert_title alert_description alert_source alert_source_event_time alert_severity_id alert_source_content

[Suspicious modification of Run registry key]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.suppress = 0
alert.suppress.fields = host
alert.suppress.period = 5m
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=prod\
(\
    (\
        (EventCode=12 OR EventCode=13)\
        AND TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"\
    )\
    OR\
    (\
        EventCode=4657\
        AND ObjectName="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"\
    )\
)\
| eval newval=coalesce(NewValue, Details)\
| search NOT newval="*OneDrive*" \
        NOT newval="*Teams*" \
        NOT newval="*EdgeUpdate*"\
        NOT newval="*MicrosoftEdge*"\
        NOT newval="*GoogleUpdate*"\
        NOT newval="*BGInfo*"\
        NOT newval="*ctfmon*"\
| search NOT TargetObject="*MicrosoftEdgeAutoLaunch*"\
NOT TargetObject="*OneDrive*"\
NOT TargetObject="*RunNotification\StartupTNoti*"\
NOT TargetObject="*Delete Cached Standalone Update Binary*"\
NOT TargetObject="*Delete Cached Update Binary*"\
NOT TargetObject="*ctfmon.exe*"\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| table host alert_source_event_time sourcetype Message\
| eval alert_title="RUN key modification"\
| eval alert_description="RUN key modification"\
| rename sourcetype as alert_source\
| eval alert_severity_id=3\
| rename Message as alert_source_content

[Création de tâche planifiée suspecte (Persistence / Execution)]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Cette alerte permet d’identifier la création ou la modification de tâches planifiées susceptibles de révéler une tentative de persistance ou d’exécution malveillante sur un système Windows. Elle corrèle les événements natifs enregistrés dans les journaux de sécurité (EventCode 4698 et 4702) avec les événements Sysmon de création de processus (EventCode 1 lorsque schtasks.exe ou at.exe sont exécutés). L’alerte se déclenche lorsqu’une tâche planifiée inclut une commande considérée comme suspecte, telle que powershell, cmd.exe, wscript, mshta ou rundll32, ou lorsqu’elle utilise un nom ou un emplacement inhabituel comme AppData, Temp ou Updater, souvent associés à des comportements malveillants.
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_nouveau_processus","data.command_line","Image"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" \
(\
   (source="WinEventLog:Security" EventCode=4698)\
   OR\
   (\
     source="WinEventLog:Microsoft-Windows-Sysmon/Operational"\
     EventCode=1\
     AND (Image="*\\schtasks.exe" OR Image="*\\at.exe")\
   )\
)\
| eval suspicious_cmd = if(\
        like(CommandLine, "%powershell%")\
     OR like(CommandLine, "%cmd.exe%")\
     OR like(CommandLine, "%wscript%")\
     OR like(CommandLine, "%cscript%")\
     OR like(CommandLine, "%rundll32%")\
     OR like(CommandLine, "%mshta%"), 1, 0)\
| eval suspicious_path = if(\
        like(TaskName,"%AppData%")\
     OR like(TaskName,"%Temp%")\
     OR like(TaskName,"%Updater%"), 1, 0)\
| where suspicious_cmd=1 OR suspicious_path=1\
| eval Message = coalesce(data.command_line, CommandLine, Image, TaskName)\
| eval alert_title="Tâche planifiée suspecte"\
| eval alert_description="Création ou modification de tâche planifiée potentiellement malveillante"\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| rename sourcetype AS alert_source\
| rename Message AS alert_source_content\
| eval alert_severity_id=3\
| table host alert_title alert_description alert_source alert_source_event_time alert_severity_id alert_source_content

[Password spraying suspect détecté sur un hôte Windows]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
description = Plusieurs tentatives d’authentification échouées (EventCode 4625) ont été effectuées depuis la même station de travail dans une courte fenêtre de temps, et visant différents comptes utilisateurs. Cette activité est typique d’une attaque de password spraying visant à contourner les politiques de verrouillage de compte.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_nouveau_processus","data.command_line","Image"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=prod source="WinEventLog:Security" EventCode=4625\
| eval Nom_du_compte_clean = mvfilter(Nom_du_compte!="-")\
| stats count AS failed_count\
        dc(Nom_du_compte_clean) AS uniq_users\
        values(Nom_du_compte_clean) AS users\
        min(_time) AS firstSeen\
        max(_time) AS lastSeen\
  BY Nom_de_la_station_de_travail ComputerName sourcetype\
| where uniq_users >= 2 AND failed_count >= 3\
| eval alert_source_event_time = strftime(firstSeen, "%Y-%m-%d %H:%M:%S")\
| eval alert_title = "Password spraying suspect (Windows)"\
| eval alert_description = "Multiples échecs d’authentification 4625 depuis la même station de travail vers plusieurs comptes dans une courte période. Comportement typique d’une attaque de password spraying."\
| rename sourcetype AS alert_source\
| eval alert_severity_id = 3\
| eval alert_source_content = "Station=" . Nom_de_la_station_de_travail .\
                              ", DC=" . ComputerName .\
                              ", nb_echecs=" . failed_count .\
                              ", nb_utilisateurs=" . uniq_users .\
                              ", utilisateurs=[" . mvjoin(users, ", ") . "]" .\
                              ", firstSeen=" . alert_source_event_time .\
                              ", lastSeen=" . strftime(lastSeen, "%Y-%m-%d %H:%M:%S")\
| table ComputerName AS host alert_title alert_description alert_source alert_source_event_time alert_severity_id alert_source_content

[Activité de beaconing C2 suspecte (Suricata) - 2h]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = https://soc_n8n/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
description = Détection de connexions réseau répétitives et régulières entre une machine interne et une adresse distante, comportement typique d’un canal Command & Control (C2) utilisé par un malware pour communiquer avec son serveur d’attaque.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_nouveau_processus","data.command_line","Image"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=prod host=suricata source="/var/log/suricata/eve.json" event_type=flow proto=TCP earliest=-2h\
| sort src_ip dest_ip dest_port _time\
| streamstats current=f window=1 last(_time) AS prev_time BY src_ip dest_ip dest_port\
| eval interval = _time - prev_time\
| where isnotnull(interval)\
| stats count AS beacon_events\
        avg(interval) AS avg_interval\
        stdev(interval) AS std_interval\
        min(interval) AS min_interval\
        max(interval) AS max_interval\
        avg(flow.bytes_toserver) AS avg_bytes_out\
        avg(flow.bytes_toclient) AS avg_bytes_in\
        min(_time) AS firstSeen\
        max(_time) AS lastSeen\
        values(sourcetype) AS sourcetype\
  BY src_ip dest_ip dest_port\
| where beacon_events >= 5\
  AND avg_interval >= 10\
  AND avg_interval <= 900\
  AND std_interval <= 5\
| eval alert_source_event_time = strftime(firstSeen, "%Y-%m-%d %H:%M:%S")\
| eval alert_title = "Activité de beaconing C2 suspecte (Suricata)"\
| eval alert_description = "Détection de connexions réseau périodiques entre une adresse IP interne et une adresse distante, compatibles avec un canal de commande et contrôle (C2)."\
| rename sourcetype AS alert_source\
| eval alert_severity_id = 4\
| eval host = src_ip\
| eval alert_source_content =\
    "src_ip=" . src_ip .\
    ", dest_ip=" . dest_ip .\
    ", dest_port=" . dest_port .\
    ", beacon_events=" . beacon_events .\
    ", avg_interval=" . round(avg_interval,2) . "s" .\
    ", std_interval=" . round(std_interval,2) . "s" .\
    ", min_interval=" . min_interval . "s" .\
    ", max_interval=" . max_interval . "s" .\
    ", avg_bytes_out=" . coalesce(avg_bytes_out,0) .\
    ", avg_bytes_in=" . coalesce(avg_bytes_in,0) .\
    ", firstSeen=" . alert_source_event_time .\
    ", lastSeen=" . strftime(lastSeen,"%Y-%m-%d %H:%M:%S")\
| table host alert_title alert_description alert_source alert_source_event_time alert_severity_id alert_source_content

[Connexions failed DC]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Si plus de 10 connexions sont failed.
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=prod host="WINSERVER-DC.dundermifflin.inc" "EventCode=4625" source="WinEventLog:Security"\
| stats count min(_time) AS alert_source_event_time BY EventCode, source\
| where count > 10\
| eval alert_source_event_time=strftime(alert_source_event_time, "%Y-%m-%d %H:%M:%S")\
| eval alert_title="Connexion failed"\
| eval alert_description="Au moins 10 connexions failed au cours des 5 dernières minutes"\
| rename source as alert_source\
| eval alert_severity_id=2\
| eval alert_source_content=""

[Kerberoasing_f]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.suppress = 0
alert.suppress.period = 5m
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Detect Kerberoasting tentatives, excluding machine account and krbtgt.
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="prod" EventCode=4769 \
Service_Name!=krbtgt\
| where NOT like(Service_Name, "%$%")\
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")\
| table host alert_source_event_time sourcetype Message\
| eval alert_title="Kerberoasting"\
| eval alert_description="Alerte kerberoasting"\
| rename sourcetype as alert_source\
| eval alert_severity_id=1\
| rename Message as alert_source_content
