index="test" EventCode=4769 
Nom_du_service!=krbtgt
| where NOT like(Nom_du_compte, "%$%")
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")
| table host alert_source_event_time sourcetype Message
| eval alert_title="Kerberoasting"
| eval alert_description="Alerte kerberoasting"
| rename sourcetype as alert_source
| eval alert_severity_id=3
| rename Message as alert_source_content