index=prod
(
    (
        (EventCode=12 OR EventCode=13)
        AND TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"
    )
    OR
    (
        EventCode=4657
        AND ObjectName="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"
    )
)
| eval newval=coalesce(NewValue, Details)
| search NOT newval="*OneDrive*" 
        NOT newval="*Teams*" 
        NOT newval="*EdgeUpdate*" 
        NOT newval="*GoogleUpdate*"
| eval alert_source_event_time = strftime(_time, "%Y-%m-%d %H:%M:%S")
| table host alert_source_event_time sourcetype Message
| eval alert_title="RUN key"
| eval alert_description="Modif RUN key"
| rename sourcetype as alert_source
| eval alert_severity_id=3
| rename Message as alert_source_content
